// Задание 1
// Выведите в консоль четные числа от 2 до 12, используйте цикл for и условие.


for (let i =  2; i <= 12; i = i + 2) {
    console.log(`Иттерация ${i}`)
}

// Задание 2
// При помощи цикла for выведите в консоль числа от 10 до 1, в обратном порядке.

    for (let x = 10; x >= 1; x = x - 1) {
    console.log(`Шаг ${x}`)
}

// Задание 3
// Перепишите 1 и 2 цикл используя цикл while.

let i = 0

while (i <= 10) {
    i = i + 2
    console.log(i)
}


let x = 11
while (x > 1) {
    x = x - 1
    console.log(x)
}
